---
kind: property
id: P:Autodesk.Revit.ApplicationServices.ControlledApplication.IsLateAddinLoading
source: html/d79bde46-2cd2-e13c-9c80-289e0d1968f4.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication.IsLateAddinLoading Property

Indicates whether this add-in is loaded on the fly or not. If it is loaded when is Revit starting up, it
is false, otherwise it should be true.

## Syntax (C#)
```csharp
public bool IsLateAddinLoading { get; }
```